Repository: lxd930808/LinguaCast
Catalog: ios/PodcastEnglishStudio/PodcastEnglishStudio/Support/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, ja, ko, pt_br, zh_hans, zh_hant

# tts.preparing
source: Preparing Chinese audio…
ar: جارٍ تحضير الصوت الصيني…
de: Chinesisches Audio wird vorbereitet…
es: Preparando audio en chino…
fr: Préparation de l’audio chinois…
ja: 中国語音声を準備中…
ko: 중국어 오디오 준비 중…
pt_br: Preparando áudio em chinês…
zh_hans: 正在准备中文音频…
zh_hant: 正在準備中文音訊…

# tts.requires_ios18
source: Chinese audio requires iOS 18 or later.
ar: يتطلب الصوت الصيني iOS 18 أو أحدث.
de: Chinesisches Audio erfordert iOS 18 oder neuer.
es: El audio en chino requiere iOS 18 o posterior.
fr: L’audio chinois nécessite iOS 18 ou une version ultérieure.
ja: 中国語音声には iOS 18 以降が必要です。
ko: 중국어 오디오는 iOS 18 이상이 필요합니다.
pt_br: O áudio em chinês requer iOS 18 ou posterior.
zh_hans: 中文音频需要 iOS 18 或更高版本。
zh_hant: 中文音訊需要 iOS 18 或以上版本。

# tts.resources_missing
source: The Chinese voice is not included in this build.
ar: لا يتضمن هذا الإصدار موارد الصوت الصيني.
de: Dieser Build enthält keine chinesischen Sprachressourcen.
es: Esta compilación no incluye la voz en chino.
fr: Cette version ne contient pas la voix chinoise.
ja: このビルドには中国語音声リソースが含まれていません。
ko: 이 빌드에는 중국어 음성 리소스가 포함되어 있지 않습니다.
pt_br: Esta versão não inclui a voz em chinês.
zh_hans: 此构建尚未包含中文语音资源。
zh_hant: 此建置尚未包含中文語音資源。

# tts.retry
source: Retry
ar: إعادة المحاولة
de: Erneut versuchen
es: Reintentar
fr: Réessayer
ja: 再試行
ko: 다시 시도
pt_br: Tentar novamente
zh_hans: 重试
zh_hant: 重試

# tts.rhythm_current
source: Current rhythm
ar: الإيقاع الحالي
de: Bisheriger Rhythmus
es: Ritmo actual
fr: Rythme actuel
ja: 現在のリズム
ko: 현재 리듬
pt_br: Ritmo atual
zh_hans: 现有节奏
zh_hant: 現有節奏

# tts.rhythm_natural
source: Natural rhythm
ar: الإيقاع الطبيعي
de: Natürlicher Rhythmus
es: Ritmo natural
fr: Rythme naturel
ja: 自然なリズム
ko: 자연스러운 리듬
pt_br: Ritmo natural
zh_hans: 自然节奏
zh_hant: 自然節奏

# tts.segment_failed
source: This sentence could not be synthesized. Retry, skip it, or switch to original audio.
ar: تعذّر تركيب نطق هذه الجملة. أعد المحاولة أو تخطَّها أو عد إلى الصوت الأصلي.
de: Dieser Satz konnte nicht synthetisiert werden. Erneut versuchen, überspringen oder zum Originalton wechseln.
es: No se pudo sintetizar esta frase. Reintenta, sáltala o vuelve al audio original.
fr: Impossible de synthétiser cette phrase. Réessayez, passez-la ou revenez à l’audio original.
ja: この文を合成できませんでした。再試行、スキップ、または原音に戻してください。
ko: 이 문장을 합성하지 못했습니다. 다시 시도하거나 건너뛰거나 원본 오디오로 돌아가세요.
pt_br: Não foi possível sintetizar esta frase. Tente novamente, pule-a ou volte ao áudio original.
zh_hans: 这句话合成失败，可重试、跳过本句或切回原音。
zh_hant: 這句話合成失敗，可重試、跳過本句或切回原音。

# tts.skip_segment
source: Skip this sentence
ar: تخطّي هذه الجملة
de: Diesen Satz überspringen
es: Saltar esta frase
fr: Passer cette phrase
ja: この文をスキップ
ko: 이 문장 건너뛰기
pt_br: Pular esta frase
zh_hans: 跳过本句
zh_hant: 跳過本句

# tts.switch_hint
source: Switching audio starts from the current sentence.
ar: عند تبديل الصوت، يبدأ التشغيل من بداية الجملة الحالية.
de: Beim Audiowechsel beginnt die Wiedergabe am Anfang des aktuellen Satzes.
es: Al cambiar de audio, se reproduce desde el inicio de la frase actual.
fr: Le changement d’audio reprend au début de la phrase actuelle.
ja: 切り替えると現在の文の先頭から再生します。
ko: 오디오를 전환하면 현재 문장의 처음부터 재생합니다.
pt_br: Ao trocar o áudio, a reprodução começa no início da frase atual.
zh_hans: 切换后从当前句子开头播放。
zh_hant: 切換後從目前句子開頭播放。

# video_save.budget
source: Cloud video storage is full. Subtitles remain available.
ar: مساحة تخزين الفيديو في السحابة ممتلئة. الترجمة النصية لا تزال متاحة.
de: Der Cloud-Videospeicher ist voll. Untertitel bleiben verfügbar.
es: El almacenamiento de vídeos en la nube está lleno. Los subtítulos siguen disponibles.
fr: Le stockage vidéo dans le cloud est plein. Les sous-titres restent disponibles.
ja: クラウドの動画保存容量がいっぱいです。字幕は引き続き利用できます。
ko: 클라우드 동영상 저장 공간이 가득 찼습니다. 자막은 계속 사용할 수 있습니다.
pt_br: O armazenamento de vídeos na nuvem está cheio. As legendas continuam disponíveis.
zh_hans: 云端视频存储空间已满，字幕仍可使用。
zh_hant: 雲端影片儲存空間已滿，字幕仍可使用。

# video_save.failed
source: Video save failed · Subtitles remain available
ar: تعذّر حفظ الفيديو · الترجمة النصية لا تزال متاحة
de: Video konnte nicht gespeichert werden · Untertitel bleiben verfügbar
es: No se pudo guardar el vídeo · Los subtítulos siguen disponibles
fr: Échec de l’enregistrement vidéo · Les sous-titres restent disponibles
ja: 動画の保存に失敗しました · 字幕は引き続き利用できます
ko: 동영상 저장 실패 · 자막은 계속 사용 가능
pt_br: Falha ao salvar vídeo · As legendas continuam disponíveis
zh_hans: 视频保存失败 · 字幕仍可使用
zh_hant: 影片儲存失敗 · 字幕仍可使用

# video_save.missing
source: Video is not saved to cloud
ar: الفيديو غير محفوظ في السحابة
de: Video ist nicht in der Cloud gespeichert
es: El vídeo no está guardado en la nube
fr: La vidéo n’est pas enregistrée dans le cloud
ja: 動画はクラウドに保存されていません
ko: 동영상이 클라우드에 저장되지 않았습니다
pt_br: O vídeo não está salvo na nuvem
zh_hans: 视频尚未保存到云端
zh_hant: 影片尚未儲存至雲端

# video_save.preparing
source: Saving video to cloud…
ar: جارٍ حفظ الفيديو في السحابة…
de: Video wird in der Cloud gespeichert…
es: Guardando vídeo en la nube…
fr: Enregistrement de la vidéo dans le cloud…
ja: 動画をクラウドに保存中…
ko: 동영상을 클라우드에 저장하는 중…
pt_br: Salvando vídeo na nuvem…
zh_hans: 正在保存视频到云端…
zh_hant: 正在儲存影片至雲端…

# video_save.query_failed
source: Could not check cloud video. Please retry.
ar: تعذّر التحقق من حالة الفيديو في السحابة. يُرجى المحاولة مجددًا.
de: Cloud-Videostatus konnte nicht geprüft werden. Bitte erneut versuchen.
es: No se pudo consultar el estado del vídeo en la nube. Inténtalo de nuevo.
fr: Impossible de vérifier l’état de la vidéo dans le cloud. Réessayez.
ja: クラウド動画の状態を確認できませんでした。再試行してください。
ko: 클라우드 동영상 상태를 확인할 수 없습니다. 다시 시도해 주세요.
pt_br: Não foi possível verificar o estado do vídeo na nuvem. Tente novamente.
zh_hans: 云端视频状态查询失败，请重试。
zh_hant: 無法查詢雲端影片狀態，請重試。

# video_save.ready
source: Video saved to cloud · Available on TV
ar: تم حفظ الفيديو في السحابة · متاح على التلفاز
de: Video in der Cloud gespeichert · Auf dem TV verfügbar
es: Vídeo guardado en la nube · Disponible en TV
fr: Vidéo enregistrée dans le cloud · Disponible sur TV
ja: 動画をクラウドに保存しました · TV で視聴可能
ko: 동영상이 클라우드에 저장됨 · TV에서 시청 가능
pt_br: Vídeo salvo na nuvem · Disponível na TV
zh_hans: 视频已保存到云端 · TV 可观看
zh_hant: 影片已儲存至雲端 · 可在 TV 觀看

# video_save.retry
source: Retry saving video
ar: إعادة محاولة حفظ الفيديو
de: Video erneut speichern
es: Reintentar guardar el vídeo
fr: Réessayer d’enregistrer la vidéo
ja: 動画の保存を再試行
ko: 동영상 저장 다시 시도
pt_br: Tentar salvar o vídeo novamente
zh_hans: 重试保存视频
zh_hant: 重試儲存影片

# youtube.channel_input
source: YouTube channel URL, RSS URL, channel ID, or @handle
ar: YouTube القناة URL، RSS URL، معرف القناة أو @handle
de: YouTube Kanal URL, RSS URL, Kanal-ID oder @handle
es: YouTube canal URL, RSS URL, ID de canal o @handle
fr: YouTube canal URL, RSS URL, identifiant de canal ou @handle
ja: YouTube チャンネル URL、 RSS URL、チャンネル ID または @handle
ko: YouTube 채널 URL, RSS URL, 채널 ID 또는 @handle
pt_br: YouTube canal URL, RSS URL, ID do canal ou @handle
zh_hans: YouTube 频道 URL、RSS URL、channel id 或 @handle
zh_hant: YouTube 頻道 URL、RSS URL、channel id 或 @handle

# youtube.channel_input_help
source: Supports YouTube channel URLs, channel IDs, RSS URLs, or @handles.
ar: يدعم قناة YouTube URL أو معرف القناة أو RSS URL أو @handle.
de: Unterstützt YouTube-Kanal URL, Kanal-ID, RSS URL oder @handle.
es: Admite YouTube canal URL, ID de canal, RSS URL o @handle.
fr: Prend en charge le canal YouTube URL, l'identifiant du canal, RSS URL ou @handle.
ja: YouTube チャンネル URL、チャンネル ID、RSS URL または @handle をサポートします。
ko: YouTube 채널 URL, 채널 ID, RSS URL 또는 @handle을 지원합니다.
pt_br: Suporta canal YouTube URL, ID do canal, RSS URL ou @handle.
zh_hans: 支持 YouTube 频道 URL、channel id、RSS URL 或 @handle。
zh_hant: 支援 YouTube 頻道 URL、channel id、RSS URL 或 @handle。

# youtube.channel_input_short
source: YouTube URL, channel ID, or @handle
ar: YouTube URL، معرف القناة أو @handle
de: YouTube URL, Kanal-ID oder @handle
es: YouTube URL, ID de canal o @handle
fr: YouTube URL, identifiant de canal ou @handle
ja: YouTube URL、チャンネルIDまたは@ハンドル
ko: YouTube URL, 채널 ID 또는 @handle
pt_br: YouTube URL, ID do canal ou @handle
zh_hans: YouTube URL、channel id 或 @handle
zh_hant: YouTube URL、channel id 或 @handle

# youtube.video_count
source: %lld videos
ar: %lld فيديو
es: %lld vídeos
fr: %lld vidéos
ja: %lld 本の動画
ko: %lld개 동영상
pt_br: %lld vídeos
zh_hans: %lld 个视频
zh_hant: %lld 部影片

# ytaccount.exiting
source: Exiting
ar: الخروج
de: Verlassen
es: Saliendo
fr: Sortie
ja: 終了します
ko: 종료
pt_br: Saindo
zh_hans: 退出中
zh_hant: 退出中

# ytaccount.log_out
source: Log out
ar: تسجيل الخروج
de: Abmelden
es: Cerrar sesión
fr: Se déconnecter
ja: ログアウト
ko: 로그아웃
pt_br: Sair
zh_hans: 退出登录
zh_hant: 登出登入

# ytaccount.logged_in_youtube
source: Logged in YouTube
ar: تم تسجيل الدخول YouTube
de: Angemeldet YouTube
es: Iniciado sesión YouTube
fr: Connecté YouTube
ja: ログインしました YouTube
ko: 로그인됨 YouTube
pt_br: Logado YouTube
zh_hans: 已登录 YouTube
zh_hant: 已登入 YouTube

# ytaccount.login_only_occurs_on_the_google_page_and_the_app_does_not_read_o
source: Login only occurs on the Google page, and the App does not read or save the account password. YouTube Whether to display ads is determined by YouTube.
ar: يتم تسجيل الدخول فقط على صفحة Google، ولا يقرأ التطبيق كلمة مرور الحساب أو يحفظها. YouTube يتم تحديد عرض الإعلانات من خلال YouTube.
de: Die Anmeldung erfolgt nur auf der Seite Google und die App liest oder speichert das Kontopasswort nicht. YouTube Ob Anzeigen angezeigt werden, wird durch YouTube bestimmt.
es: El inicio de sesión solo se produce en la página Google y la aplicación no lee ni guarda la contraseña de la cuenta. YouTube La visualización de anuncios está determinada por YouTube.
fr: La connexion s'effectue uniquement sur la page Google et l'application ne lit ni n'enregistre le mot de passe du compte. YouTube L'affichage ou non des annonces est déterminé par YouTube.
ja: ログインはGoogle ページでのみ行われ、アプリはアカウントのパスワードを読み取ったり保存したりしません。 YouTube 広告を表示するかどうかはYouTube によって決まります。
ko: 로그인은 Google 페이지에서만 이루어지며, 앱은 계정 비밀번호를 읽거나 저장하지 않습니다. YouTube 광고 표시 여부는 YouTube에 따라 결정됩니다.
pt_br: O login ocorre apenas na página Google, e o App não lê nem salva a senha da conta. YouTube A exibição de anúncios é determinada por YouTube.
zh_hans: 登录只发生在 Google 页面内，App 不读取、不保存账号密码。YouTube 是否展示广告由 YouTube 决定。
zh_hant: 登入只發生在 Google 頁面內，App 不讀取、不儲存帳號密碼。 YouTube 是否展示廣告由 YouTube 決定。

# ytaccount.sign_in_to_try_ad_free_and_recommendations
source: Sign in to try ad-free and recommendations
ar: قم بتسجيل الدخول للتجربة بدون إعلانات وتوصيات
de: Melden Sie sich an, um Werbefreiheit und Empfehlungen auszuprobieren
es: Inicia sesión para probar sin publicidad y recibir recomendaciones
fr: Connectez-vous pour essayer sans publicité et recommandations
ja: ログインして広告なしとおすすめを試す
ko: 로그인하여 광고 없이 추천을 받아보세요
pt_br: Faça login para experimentar recomendações e sem anúncios
zh_hans: 登录以尝试免广告和推荐
zh_hant: 登入嘗試免廣告和推薦

# ytaccount.youtube_account
source: YouTube Account
ar: YouTube الحساب
de: YouTube Konto
es: YouTube Cuenta
fr: YouTube Compte
ja: YouTube アカウント
ko: YouTube 계정
pt_br: YouTube Conta
zh_hans: YouTube 账号
zh_hant: YouTube 帳號

# ytchannel_detail.all_loaded
source: All loaded
ar: جميع تحميلها
de: Alles geladen
es: todo cargado
fr: Tout chargé
ja: すべてロードされました
ko: 모두 로드됨
pt_br: Tudo carregado
zh_hans: 已加载全部
zh_hant: 已載入全部

# ytchannel_detail.get_all
source: Get all
ar: احصل على كل شيء
de: Holen Sie sich alles
es: Obtener todo
fr: Obtenez tout
ja: すべて取得
ko: 모두 가져오기
pt_br: Pegue tudo
zh_hans: 获取全部
zh_hant: 獲取全部

# ytchannel_detail.get_all_in
source: Get all in...
ar: ادخل الكل...
de: Gehen Sie aufs Ganze...
es: Métete todo...
fr: Mettez-vous à fond...
ja: 全部入れて…
ko: 모두 들어가세요...
pt_br: Entre tudo...
zh_hans: 获取全部中...
zh_hant: 獲取全部...

# ytchannel_detail.llm_translating
source: LLM Translating
ar: LLM ترجمة
de: LLM Übersetzen
es: LLM Traduciendo
fr: LLM Traduction
ja: LLM 翻訳中
ko: LLM 번역하는 중
pt_br: LLM Traduzindo
zh_hans: LLM 翻译中
zh_hant: LLM 翻譯中

# ytchannel_detail.no_video_yet
source: No video yet
ar: لا يوجد فيديو بعد
de: Noch kein Video
es: Aún no hay vídeo
fr: Pas encore de vidéo
ja: まだビデオはありません
ko: 아직 동영상이 없습니다.
pt_br: Nenhum vídeo ainda
zh_hans: 暂无视频
zh_hant: 暫無影片

# ytchannel_detail.playing_status
source: Playing status
ar: حالة اللعب
de: Spielstatus
es: Estado de juego
fr: Statut de jeu
ja: プレイ状況
ko: 재생 상태
pt_br: Status de jogo
zh_hans: 播放状态
zh_hant: 播放狀態

# ytchannel_detail.retry_subtitles
source: Retry subtitles
ar: أعد محاولة الترجمة
de: Untertitel erneut versuchen
es: Reintentar subtítulos
fr: Réessayer les sous-titres
ja: 字幕を再試行する
ko: 자막 다시 시도
pt_br: Tentar novamente as legendas
zh_hans: 重试字幕
zh_hant: 重試字幕

# ytchannel_detail.subtitles_not_requested
source: Subtitles not requested
ar: لم يتم طلب ترجمات
de: Untertitel nicht erwünscht
es: Subtítulos no solicitados
fr: Sous-titres non demandés
ja: 字幕はリクエストされていません
ko: 자막이 요청되지 않았습니다.
pt_br: Legendas não solicitadas
zh_hans: 字幕未请求
zh_hant: 字幕未請求

# ytchannel_detail.translation_to_be_retried
source: Translation to be retried
ar: ستتم إعادة محاولة الترجمة
de: Die Übersetzung muss wiederholt werden
es: Traducción para ser reintentada
fr: Traduction à réessayer
ja: 翻訳を再試行します
ko: 재시도할 번역
pt_br: Tradução a ser repetida
zh_hans: 翻译待重试
zh_hant: 翻譯待重試

# ytchannel_detail.video_does_not_exist
source: Video does not exist
ar: الفيديو غير موجود
de: Video existiert nicht
es: El vídeo no existe
fr: La vidéo n'existe pas
ja: ビデオが存在しません
ko: 동영상이 존재하지 않습니다
pt_br: O vídeo não existe
zh_hans: 视频不存在
zh_hant: 影片不存在

# ytchannel_detail.videos
source: Videos
ar: فيديو
de: Video
es: vídeo
fr: vidéo
ja: ビデオ
ko: 비디오
pt_br: vídeo
zh_hans: 视频
zh_hant: 影片

# ytplayer.go_back
source: Back
ar: رجوع
de: Zurück
es: Atrás
fr: Retour
ja: 戻る
ko: 뒤로
pt_br: Voltar
zh_hans: 返回
zh_hant: 返回

# ytplayer.no_usable_video_stream_was_resolved
source: No usable video stream was resolved.
ar: لم يتم حل أي دفق فيديو قابل للاستخدام.
de: Es wurde kein verwendbarer Videostream aufgelöst.
es: No se resolvió ninguna transmisión de video utilizable.
fr: Aucun flux vidéo utilisable n'a été résolu.
ja: 使用可能なビデオ ストリームが解決されませんでした。
ko: 사용 가능한 비디오 스트림이 확인되지 않았습니다.
pt_br: Nenhum fluxo de vídeo utilizável foi resolvido.
zh_hans: 没有解析到可用的视频流。
zh_hant: 沒有解析到可用的視訊串流。

# ytplayer.quality_unavailable_using_best
source: Requested quality unavailable; using best playable stream.
ar: الجودة المطلوبة غير متاحة؛ يتم استخدام أفضل بث قابل للتشغيل.
de: Die gewünschte Qualität ist nicht verfügbar; der beste abspielbare Stream wird verwendet.
es: La calidad solicitada no está disponible; se usa la mejor transmisión reproducible.
fr: La qualité demandée est indisponible ; utilisation du meilleur flux lisible.
ja: 指定した画質を利用できないため、再生可能な最適ストリームを使用します。
ko: 요청한 화질을 사용할 수 없어 재생 가능한 최적 스트림을 사용합니다.
pt_br: A qualidade solicitada não está disponível; usando o melhor stream reproduzível.
zh_hans: 请求的画质不可用，正在使用最佳可播放流。
zh_hant: 要求的畫質無法使用，正在使用最佳可播放串流。

# ytplayer.stream_preparation_timed_out
source: Timed out while preparing the selected YouTube stream.
ar: انتهت مهلة إعداد بث YouTube المحدد.
de: Zeitüberschreitung beim Vorbereiten des ausgewählten YouTube-Streams.
es: Se agotó el tiempo de espera al preparar la transmisión de YouTube seleccionada.
fr: Le délai de préparation du flux YouTube sélectionné a expiré.
ja: 選択した YouTube ストリームの準備がタイムアウトしました。
ko: 선택한 YouTube 스트림을 준비하는 동안 시간이 초과되었습니다.
pt_br: O tempo limite foi atingido ao preparar o stream selecionado do YouTube.
zh_hans: 准备所选 YouTube 视频流时超时。
zh_hant: 準備所選 YouTube 視訊串流時逾時。

# ytplayer.the_current_video_cannot_be_parsed_and_played
source: The current video cannot be parsed and played
ar: لا يمكن تحليل الفيديو الحالي وتشغيله
de: Das aktuelle Video kann nicht analysiert und abgespielt werden
es: El vídeo actual no se puede analizar ni reproducir.
fr: La vidéo actuelle ne peut pas être analysée et lue
ja: 現在のビデオを解析して再生できません
ko: 현재 동영상을 구문 분석하고 재생할 수 없습니다.
pt_br: O vídeo atual não pode ser analisado e reproduzido
zh_hans: 当前视频无法解析播放
zh_hant: 目前影片無法解析播放

# ytsubscriptions.add_channel
source: Add channel
ar: أضف قناة
de: Kanal hinzufügen
es: Agregar canal
fr: Ajouter une chaîne
ja: チャンネルを追加
ko: 채널 추가
pt_br: Adicionar canal
zh_hans: 添加频道
zh_hant: 新增頻道

# ytsubscriptions.channels
source: Channels
ar: قناة
de: Kanal
es: canal
fr: canal
ja: チャンネル
ko: 채널
pt_br: canal
zh_hans: 频道
zh_hant: 頻道

# ytsubscriptions.there_is_an_error
source: There is an error
ar: هناك خطأ
de: Es liegt ein Fehler vor
es: hay un error
fr: Il y a une erreur
ja: エラーがあります
ko: 오류가 있습니다
pt_br: Há um erro
zh_hans: 有错误
zh_hant: 有錯誤

# ytvideo_player.asr_resolving_audio
source: Resolving audio stream
ar: جارٍ تحليل بث الصوت
de: Audiostream wird aufgelöst
es: Resolviendo flujo de audio
fr: Résolution du flux audio
ja: 音声ストリームを解析中
ko: 오디오 스트림 해석 중
pt_br: Resolvendo fluxo de áudio
zh_hans: 正在解析音频流
zh_hant: 正在解析音訊流

# ytvideo_player.automatically_obtain_subtitles_after_entering_the_play_page
source: Automatically obtain subtitles after entering the play page
ar: الحصول على الترجمة تلقائيًا بعد الدخول إلى صفحة التشغيل
de: Erhalten Sie automatisch Untertitel, nachdem Sie die Wiedergabeseite aufgerufen haben
es: Obtener subtítulos automáticamente después de ingresar a la página de reproducción
fr: Obtenez automatiquement les sous-titres après avoir accédé à la page de lecture
ja: 再生ページに入ると自動的に字幕を取得します
ko: 플레이 페이지 진입 후 자동으로 자막 획득
pt_br: Obtenha legendas automaticamente após entrar na página de reprodução
zh_hans: 进入播放页后自动获取字幕
zh_hant: 進入播放頁後自動取得字幕

# ytvideo_player.bilingual_subtitles_are_ready
source: Bilingual subtitles are ready
ar: ترجمات ثنائية اللغة جاهزة
de: Zweisprachige Untertitel sind fertig
es: Los subtítulos bilingües están listos.
fr: Les sous-titres bilingues sont prêts
ja: バイリンガル字幕も準備完了
ko: 이중 언어 자막이 준비되었습니다
pt_br: As legendas bilíngues estão prontas
zh_hans: 双语字幕已就绪
zh_hant: 雙語字幕已就緒

# ytvideo_player.cloud_generating
source: Generating in the cloud
ar: جارٍ الإنشاء في السحابة
de: Wird in der Cloud generiert
es: Generando en la nube
fr: Génération dans le cloud
ja: クラウドで生成中
ko: 클라우드에서 생성 중
pt_br: Gerando na nuvem
zh_hans: 正在云端生成
zh_hant: 正在雲端生成

# ytvideo_player.current_sentence
source: Current sentence
ar: الجملة الحالية
de: Aktueller Satz
es: Frase actual
fr: Phrase actuelle
ja: 現在の文
ko: 현재 문장
pt_br: Frase atual
zh_hans: 当前句
zh_hant: 目前句

# ytvideo_player.currently_not_able_to_re_transcribe_youtube_videos_ios_iframe_an
source: Currently not able to re-transcribe YouTube videos: iOS IFrame and tvOS compatible playback paths do not reliably provide uploadable audio files. If there are existing English subtitles, we will continue to try to translate them; if they need to be re-translated, subsequent versions will support the import of local audio files.
ar: غير قادر حاليًا على إعادة نسخ مقاطع فيديو YouTube: لا توفر مسارات التشغيل المتوافقة مع iOS IFrame وtvOS ملفات صوتية قابلة للتحميل بشكل موثوق. إذا كانت هناك ترجمات باللغة الإنجليزية، فسنستمر في محاولة ترجمتها؛ إذا كانت هناك حاجة إلى إعادة ترجمتها، فإن الإصدارات اللاحقة ستدعم استيراد الملفات الصوتية المحلية.
de: Derzeit können YouTube-Videos nicht erneut transkribiert werden: Mit iOS IFrame und tvOS kompatible Wiedergabepfade stellen nicht zuverlässig hochladbare Audiodateien bereit. Sollten bereits englische Untertitel vorhanden sein, werden wir weiterhin versuchen, diese zu übersetzen; Wenn sie neu übersetzt werden müssen, unterstützen nachfolgende Versionen den Import lokaler Audiodateien.
es: Actualmente no se pueden volver a transcribir videos YouTube: las rutas de reproducción compatibles con iOS IFrame y tvOS no proporcionan de manera confiable archivos de audio cargables. Si existen subtítulos en inglés, continuaremos intentando traducirlos; Si es necesario volver a traducirlos, las versiones posteriores admitirán la importación de archivos de audio locales.
fr: Actuellement, il n'est pas possible de retranscrire les vidéos YouTube : les chemins de lecture compatibles iOS IFrame et tvOS ne fournissent pas de manière fiable les fichiers audio téléchargeables. S'il existe des sous-titres anglais, nous continuerons d'essayer de les traduire ; s'ils doivent être retraduits, les versions ultérieures prendront en charge l'importation de fichiers audio locaux.
ja: 現在、YouTube ビデオを再転写することはできません。iOS IFrame および tvOS と互換性のある再生パスでは、アップロード可能なオーディオ ファイルが確実に提供されません。既存の英語字幕がある場合は、引き続き翻訳を試みます。再翻訳が必要な場合は、後続のバージョンでローカル オーディオ ファイルのインポートがサポートされるようになります。
ko: 현재 YouTube 동영상을 다시 스크립트로 작성할 수 없습니다. iOS IFrame 및 tvOS 호환 재생 경로는 업로드 가능한 오디오 파일을 안정적으로 제공하지 않습니다. 기존 영어 자막이 있는 경우 계속해서 번역을 시도할 예정입니다. 재번역이 필요한 경우 후속 버전에서는 로컬 오디오 파일 가져오기를 지원합니다.
pt_br: Atualmente não é possível transcrever novamente vídeos YouTube: iOS IFrame e caminhos de reprodução compatíveis com tvOS não fornecem arquivos de áudio carregáveis de maneira confiável. Se existirem legendas em inglês, continuaremos tentando traduzi-las; se precisarem ser traduzidos novamente, as versões subsequentes suportarão a importação de arquivos de áudio locais.
zh_hans: 当前不能重新转写 YouTube 视频：iOS IFrame 和 tvOS 兼容播放路径不能稳定提供可上传的音频文件。已有英文字幕会继续尝试翻译；需要重转写时，后续版本会支持导入本地音频文件。
zh_hant: 目前無法重新轉寫 YouTube 影片：iOS IFrame 和 tvOS 相容播放路徑無法穩定提供可上傳的音訊檔案。已有英文字幕會繼續嘗試翻譯；需要重寫時，後續版本會支援匯入本地音訊檔案。

# ytvideo_player.enter_fullscreen
source: Enter Full Screen
ar: دخول وضع ملء الشاشة
de: Vollbild
es: Pantalla completa
fr: Plein écran
ja: フルスクリーンにする
ko: 전체 화면으로 전환
pt_br: Tela cheia
zh_hans: 进入全屏
zh_hant: 進入全螢幕

# ytvideo_player.exit_fullscreen
source: Exit Full Screen
ar: الخروج من وضع ملء الشاشة
de: Vollbild beenden
es: Salir de pantalla completa
fr: Quitter le plein écran
ja: フルスクリーンを終了
ko: 전체 화면 종료
pt_br: Sair da tela cheia
zh_hans: 退出全屏
zh_hant: 退出全螢幕

# ytvideo_player.fetching
source: Fetching
ar: الحصول على
de: Erhalten
es: Conseguir
fr: Obtenir
ja: 入手
ko: 점점
pt_br: Obtendo
zh_hans: 获取中
zh_hant: 獲取中

# ytvideo_player.following_playback
source: Following playback
ar: متابعة التشغيل
de: Folgt der Wiedergabe
es: Siguiendo la reproducción
fr: Suit la lecture
ja: 再生に追従
ko: 재생 따라가기
pt_br: Acompanhando a reprodução
zh_hans: 跟随播放
zh_hant: 跟隨播放

# ytvideo_player.generate_from_audio
source: Generate bilingual content from audio
ar: إنشاء محتوى ثنائي اللغة من الصوت
de: Zweisprachige Inhalte aus Audio erzeugen
es: Generar contenido bilingüe desde el audio
fr: Générer du contenu bilingue à partir de l'audio
ja: 音声からバイリンガル字幕を生成
ko: 오디오로 이중 언어 콘텐츠 생성
pt_br: Gerar conteúdo bilíngue a partir do áudio
zh_hans: 使用音频生成双语内容
zh_hant: 使用音訊生成雙語內容

# ytvideo_player.get_subtitles
source: Get subtitles
ar: احصل على ترجمات
de: Holen Sie sich Untertitel
es: Obtener subtítulos
fr: Obtenir des sous-titres
ja: 字幕を取得する
ko: 자막 받기
pt_br: Obtenha legendas
zh_hans: 获取字幕
zh_hant: 取得字幕

# ytvideo_player.getting_english_subtitles
source: Getting English subtitles
ar: الحصول على ترجمات باللغة الإنجليزية
de: Englische Untertitel bekommen
es: Obtener subtítulos en inglés
fr: Obtenir des sous-titres anglais
ja: 英語字幕の取得
ko: 영어 자막 받기
pt_br: Obtendo legendas em inglês
zh_hans: 正在获取英文字幕
zh_hant: 正在取得英文字幕

# ytvideo_player.next_sentence
source: Next sentence
ar: الجملة التالية
de: Nächster Satz
es: Frase siguiente
fr: Phrase suivante
ja: 次の文
ko: 다음 문장
pt_br: Próxima frase
zh_hans: 下一句
zh_hant: 下一句

# ytvideo_player.not_requested
source: Not requested
ar: ليتم الحصول عليها
de: Zu erhalten
es: por obtener
fr: A obtenir
ja: 入手予定
ko: 획득 예정
pt_br: Para ser obtido
zh_hans: 待获取
zh_hant: 待獲取

# ytvideo_player.ok
source: OK
ar: جيد
de: Gut
es: bueno
fr: Bon
ja: 良い
ko: 좋음
pt_br: Bom
zh_hans: 好
zh_hant: 好

# ytvideo_player.open_in_youtube
source: Open in YouTube
ar: مفتوح في YouTube
de: Öffnen in YouTube
es: Abierto en YouTube
fr: Ouvert dans YouTube
ja: YouTubeでオープン
ko: YouTube에서 열기
pt_br: Abrir em YouTube
zh_hans: 在 YouTube 打开
zh_hant: 在 YouTube 打開

# ytvideo_player.partially_ready
source: Partially ready
ar: جاهز جزئيا
de: teilweise fertig
es: parcialmente listo
fr: partiellement prêt
ja: 部分的に準備完了
ko: 부분적으로 준비됨
pt_br: parcialmente pronto
zh_hans: 部分就绪
zh_hant: 部分就緒
